{
  "abstract": false,
  "anchor": "#page-md-batteries-pico-http-readme",
  "category": "pages",
  "const": false,
  "definition": "",
  "details": "The contents of this directory were copied and modified from the [Pico HTTP Parser](https://github.com/h2o/picohttpparser) project under the terms of the MIT License.\n\nThe original copyright notice is preserved in the source files, and also quoted here:\n\n\n\n```cpp\n/*\n * Copyright (c) 2009-2014 Kazuho Oku, Tokuhiro Matsuno, Daisuke Murase,\n *                         Shigeo Mitsunari\n *\n * The software is licensed under either the MIT License (below) or the Perl\n * license.\n *\n * Permission is hereby granted, free of charge, to any person obtaining a copy\n * of this software and associated documentation files (the \"Software\"), to\n * deal in the Software without restriction, including without limitation the\n * rights to use, copy, modify, merge, publish, distribute, sublicense, and/or\n * sell copies of the Software, and to permit persons to whom the Software is\n * furnished to do so, subject to the following conditions:\n *\n * The above copyright notice and this permission notice shall be included in\n * all copies or substantial portions of the Software.\n *\n * THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\n * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\n * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\n * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\n * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING\n * FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS\n * IN THE SOFTWARE.\n */\n```\n\nDO NOT remove this notice from the files in this directory!\n\nThe Pico HTTP Parser and H2O projects are amazing and awesome; you should definitely support the authors and the project!!! ",
  "explicit": false,
  "fullname": "::md_batteries_pico_http_README",
  "hasAdditionalMembers": false,
  "hasDetails": true,
  "inline": false,
  "kind": "page",
  "language": "",
  "location": {
    "column": 0,
    "file": "batteries/pico_http/README.md",
    "line": 0
  },
  "name": "md_batteries_pico_http_README",
  "override": false,
  "parent": null,
  "refid": "md_batteries_pico_http_README",
  "static": false,
  "strong": false,
  "title": "NOTICE",
  "url": "/_autogen/Pages/md_batteries_pico_http_README/#page-md-batteries-pico-http-readme",
  "visibility": "public"
}